proposta/fapesp/build/sumula.tex
% Created 2023-06-28 Wed 17:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{todonotes}
\usepackage[brazil, american]{babel}
\usepackage{amsthm}
\usepackage[a4paper, total={6in, 8in}]{geometry}
\author{Ieremies Vieira da Fonseca Romero}
\date{}
\title{Súmula Curricular\\\medskip
\large Programação Linear Inteira aplicada a problemas de Coloração em Grafos}
\hypersetup{
 pdfauthor={Ieremies Vieira da Fonseca Romero},
 pdftitle={Súmula Curricular},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\usepackage[date=year]{biblatex}
\addbibresource{~/arq/bib.bib}
\begin{document}

\maketitle

\section*{Formação}
\label{sec:orgd9e0f78}
\begin{itemize}
\item Bacharelado em Ciência da Computação
\item Instituto de Computação da Universidade Estadual de Campinas - UNICAMP
\item Início: Março de 2018
\item Conclusão: Dezembro de 2022
\end{itemize}

\section*{Histórico Profissional}
\label{sec:orgaab7df5}
\begin{description}
\item[{Professor de programação para ensino médio}] (jan, 2022 - atual) Colégio e pré-vestibular Elite Campinas.
\item[{Coordenador de unidade no UNICAMP de Portas Abertas}] (ago, 2022) Instituto de Computação da UNICAMP.
\item[{Representante discente na Comissão de Graduação}] (abr, 2022 - dez, 2022) Instituto de Computação da UNICAMP.
\item[{Representante discente na Congregação do Instituto de Computação}] (jul, 2021 - abr, 2022) Instituto de Computação da UNICAMP.
\item[{Estagiário em desenvolvimento de software}] (mar, 2022 - abr, 2022) SF-Labs, Visio.
\item[{Bolsista de Iniciação Científica}] (ago, 2019 - jul, 2020) Fundação de Amparo a Pesquisa do Estado de São Paulo
\item[{Coordenador de cursinho popular}] (ago, 2018 - abr, 2019) Projeto Além da Escola
\item[{Professor voluntário de programação em cursinho popular}] (mar, 2018 - abr, 2019) Projeto Além da Escola.
\end{description}
\section*{Resultados}
\label{sec:org4d1e77f}
\begin{itemize}
\item da Silva FJ, Miyazawa FK, Romero IV, Schouery R. Tight Bounds for the Price of Anarchy and Stability in Sequential Transportation Games. arXiv preprint arXiv:2007.08726. 2020 Jul 17.
\end{itemize}
\section*{Financiamentos à pesquisa}
\label{sec:orgfc8c3da}
Recebi recursos correspondentes a bolsa de Iniciação Científica da Fundação de Amparo à Pesquisa do Estado de São Paulo no projeto \textbf{``Aplicações de Teoria dos Jogos Algorítmica a Problemas de Transporte''} (2019/14492-9) entre Agosto de 2019 e Julho de 2020, o qual recebeu conceito máximo.
\section*{Indicadores quantitativos}
\label{sec:org2d4513a}
Não se aplica
\section*{Links}
\label{sec:orgb9f7298}
\begin{description}
\item[{ORCID}] orcid.org/0000-0002-5801-3774
\end{description}
\section*{Outras informações}
\label{sec:org18eea9a}
Ministrei dois workshops (git e python) para a graduação.
Nos últimos anos, me dediquei ao ensino de programação no ensino médio bem como em avançar na minha
\subsection*{Premiações}
\label{sec:org3a79809}
\begin{itemize}
\item Primeiro lugar da turma de Ciência da Computação na UNICAMP
\item Destaque IC e SBC
\item Primeiro lugar do vestibular
\end{itemize}
\end{document}